Приложение/InformationRegisters/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Приложение/CommonModules/ОбщийСерверныйМодуль/Ext/Module.bsl
//работа с файлами
Функция ПолучитьАдресКартинкиИзВХ(Ссылка,УникальныйИдентификатор) Экспорт
	СтруктураДанных = РегистрыСведений.Файлы.ПолучитьСтруктуруДанныхФайлаИзБазы(Ссылка);
	ДвоичныеДанные =  СтруктураДанных.ДвоичныеДанныеФайла;
	
	Если ДвоичныеДанные <> Неопределено Тогда
		АдресКартинкиВх = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		Возврат АдресКартинкиВх;
	КонецЕсли;    
КонецФункции // ПолучитьАдресКартинкиИзВХ()


Процедура ЗаписатьКартинкуИзВХ(ОбъектСсылка,АдресКартинки,РазмерФайла,РасширениеФайла)   Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
		РегистрыСведений.Файлы.ЗаписатьФайлВБазу(ОбъектСсылка,ДвоичныеДанные,РазмерФайла,РасширениеФайла);
	КонецЕсли;	
	
КонецПроцедуры
